##### -- Create the Housing_Unit_Status Table

In [5]:
%%bigquery
create table acs_2018_modeled.Housing_Unit_Status as
select distinct NAME, DP04_0001E, cast(replace(DP04_0002PE,
'-', '0') as FLOAT64) as DP04_0002PE, cast(replace(
DP04_0003PE,'-', '0') as FLOAT64) as DP04_0003PE,
DP04_0006E
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [19]:
%%bigquery
select NAME, DP04_0001E, DP04_0002PE,
DP04_0003PE, DP04_0006E
from acs_2018_staging.housing
where NAME = 'ZCTA5 00775'
limit 10

          NAME  DP04_0001E DP04_0002PE DP04_0003PE  DP04_0006E
0  ZCTA5 00775        1494        31.1        68.9        1494

In [16]:
%%bigquery
select NAME, DP04_0001E, DP04_0002PE,
DP04_0003PE, DP04_0006E
from acs_2018_modeled.Housing_Unit_Status
where NAME = 'ZCTA5 00775'
limit 10

          NAME  DP04_0001E  DP04_0002PE  DP04_0003PE  DP04_0006E
0  ZCTA5 00775        1494         31.1         68.9        1494

##### -- Create Housing_Unit table

In [17]:
%%bigquery
create table acs_2018_modeled.Housing_Unit as
select distinct NAME, cast(replace(DP04_0007PE,
'-', '0') as FLOAT64) as DP04_0007PE, cast(replace(
DP04_0008PE, '-', '0') as FLOAT64) as DP04_0008PE,
cast(replace(DP04_0009PE, '-', '0') as FLOAT64) as
DP04_0009PE, cast(replace(DP04_0010PE, '-', '0') as
FLOAT64) as DP04_0010PE, cast(replace(DP04_0011PE,
'-', '0') as FLOAT64) as DP04_0011PE, cast(replace(
DP04_0012PE, '-', '0') as FLOAT64) as DP04_0012PE,
cast(replace(DP04_0013PE, '-', '0') as FLOAT64) as 
DP04_0013PE, cast(replace(DP04_0014PE, '-', '0') as 
FLOAT64) as DP04_0014PE, cast(replace(DP04_0015PE,
'-', '0') as FLOAT64) as DP04_0015PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [18]:
%%bigquery
select NAME, DP04_0007PE, DP04_0008PE, DP04_0009PE,
DP04_0010PE, DP04_0011PE, DP04_0012PE, DP04_0013PE,
DP04_0014PE, DP04_0015PE
from acs_2018_staging.housing
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0007PE,DP04_0008PE,DP04_0009PE,DP04_0010PE,DP04_0011PE,DP04_0012PE,DP04_0013PE,DP04_0014PE,DP04_0015PE
0,ZCTA5 00775,58.3,16.1,2.5,15.7,1.9,0.3,3.5,1.7,0

In [20]:
%%bigquery
select NAME, DP04_0007PE, DP04_0008PE, DP04_0009PE,
DP04_0010PE, DP04_0011PE, DP04_0012PE, DP04_0013PE,
DP04_0014PE, DP04_0015PE
from acs_2018_modeled.Housing_Unit
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0007PE,DP04_0008PE,DP04_0009PE,DP04_0010PE,DP04_0011PE,DP04_0012PE,DP04_0013PE,DP04_0014PE,DP04_0015PE
0,ZCTA5 00775,58.3,16.1,2.5,15.7,1.9,0.3,3.5,1.7,0.0

##### -- Create Built_year table

In [21]:
%%bigquery
create table acs_2018_modeled.Built_year as
select distinct NAME, cast(replace(DP04_0017PE,
'-', '0') as FLOAT64) as DP04_0017PE, cast(replace(
DP04_0018PE, '-', '0') as FLOAT64) as DP04_0018PE,
cast(replace(DP04_0019PE, '-', '0') as FLOAT64) as
DP04_0019PE, cast(replace(DP04_0020PE, '-', '0') as
FLOAT64) as DP04_0020PE, cast(replace(DP04_0021PE,
'-', '0') as FLOAT64) as DP04_0021PE, cast(replace(
DP04_0022PE, '-', '0') as FLOAT64) as DP04_0022PE,
cast(replace(DP04_0023PE, '-', '0') as FLOAT64) as 
DP04_0023PE, cast(replace(DP04_0024PE, '-', '0') as 
FLOAT64) as DP04_0024PE, cast(replace(DP04_0025PE,
'-', '0') as FLOAT64) as DP04_0025PE, cast(replace(
DP04_0026PE,'-', '0') as FLOAT64) as DP04_0026PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [22]:
%%bigquery
select NAME, DP04_0017PE, DP04_0018PE, DP04_0019PE,
DP04_0020PE, DP04_0021PE, DP04_0022PE, DP04_0023PE,
DP04_0024PE, DP04_0025PE, DP04_0026PE
from acs_2018_staging.housing
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0017PE,DP04_0018PE,DP04_0019PE,DP04_0020PE,DP04_0021PE,DP04_0022PE,DP04_0023PE,DP04_0024PE,DP04_0025PE,DP04_0026PE
0,ZCTA5 00775,0.6,3.7,30.9,28.4,10.2,12.6,10.2,1.8,1,0.5

In [23]:
%%bigquery
select NAME, DP04_0017PE, DP04_0018PE, DP04_0019PE,
DP04_0020PE, DP04_0021PE, DP04_0022PE, DP04_0023PE,
DP04_0024PE, DP04_0025PE, DP04_0026PE
from acs_2018_modeled.Built_year
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0017PE,DP04_0018PE,DP04_0019PE,DP04_0020PE,DP04_0021PE,DP04_0022PE,DP04_0023PE,DP04_0024PE,DP04_0025PE,DP04_0026PE
0,ZCTA5 00775,0.6,3.7,30.9,28.4,10.2,12.6,10.2,1.8,1.0,0.5

##### -- Create Housing_Value table

In [24]:
%%bigquery
create table acs_2018_modeled.Housing_Value as
select distinct NAME, cast(replace(DP04_0081PE,
'-', '0') as FLOAT64) as DP04_0081PE, cast(replace(
DP04_0082PE, '-', '0') as FLOAT64) as DP04_0082PE,
cast(replace(DP04_0083PE, '-', '0') as FLOAT64) as
DP04_0083PE, cast(replace(DP04_0084PE, '-', '0') as
FLOAT64) as DP04_0084PE, cast(replace(DP04_0085PE,
'-', '0') as FLOAT64) as DP04_0085PE, cast(replace(
DP04_0086PE, '-', '0') as FLOAT64) as DP04_0086PE,
cast(replace(DP04_0087PE, '-', '0') as FLOAT64) as 
DP04_0087PE, cast(replace(DP04_0088PE, '-', '0') as 
FLOAT64) as DP04_0088PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [25]:
%%bigquery
select NAME, DP04_0081PE, DP04_0082PE, DP04_0083PE,
DP04_0084PE, DP04_0085PE, DP04_0086PE, DP04_0087PE,
DP04_0088PE
from acs_2018_staging.housing
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0081PE,DP04_0082PE,DP04_0083PE,DP04_0084PE,DP04_0085PE,DP04_0086PE,DP04_0087PE,DP04_0088PE
0,ZCTA5 00775,13.2,31.4,9.8,12.5,17.2,9.1,2.4,4.4

In [26]:
%%bigquery
select NAME, DP04_0081PE, DP04_0082PE, DP04_0083PE,
DP04_0084PE, DP04_0085PE, DP04_0086PE, DP04_0087PE,
DP04_0088PE
from acs_2018_modeled.Housing_Value
where NAME = 'ZCTA5 00775'
limit 10

,NAME,DP04_0081PE,DP04_0082PE,DP04_0083PE,DP04_0084PE,DP04_0085PE,DP04_0086PE,DP04_0087PE,DP04_0088PE
0,ZCTA5 00775,13.2,31.4,9.8,12.5,17.2,9.1,2.4,4.4

##### -- Create PrivatePublic_School_Enrollment table

In [1]:
%%bigquery
create table acs_2018_modeled.PrivatePublic_School_Enrollment as
select distinct NAME, S1401_C03_008E, S1401_C05_008E,
S1401_C03_009E, S1401_C05_009E
from acs_2018_staging.school_enrollment
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [2]:
%%bigquery
select NAME, S1401_C03_008E, S1401_C05_008E,
S1401_C03_009E, S1401_C05_009E
from acs_2018_staging.school_enrollment
where NAME = 'ZCTA5 00775'
limit 10

          NAME  S1401_C03_008E  S1401_C05_008E  S1401_C03_009E  S1401_C05_009E
0  ZCTA5 00775               3              15               0               0

In [3]:
%%bigquery
select NAME, S1401_C03_008E, S1401_C05_008E,
S1401_C03_009E, S1401_C05_009E
from acs_2018_modeled.PrivatePublic_School_Enrollment
where NAME = 'ZCTA5 00775'
limit 10

          NAME  S1401_C03_008E  S1401_C05_008E  S1401_C03_009E  S1401_C05_009E
0  ZCTA5 00775               3              15               0               0

##### -- Create General_School_Enrollment table

In [4]:
%%bigquery
create table acs_2018_modeled.General_School_Enrollment as
select distinct NAME, S1401_C01_004E, S1401_C01_005E, 
S1401_C01_006E, S1401_C01_007E, S1401_C01_008E,
S1401_C01_009E
from acs_2018_staging.school_enrollment
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [5]:
%%bigquery
select NAME, S1401_C01_004E, S1401_C01_005E, 
S1401_C01_006E, S1401_C01_007E, S1401_C01_008E,
S1401_C01_009E
from acs_2018_staging.school_enrollment
where NAME = 'ZCTA5 00775'
limit 10

,NAME,S1401_C01_004E,S1401_C01_005E,S1401_C01_006E,S1401_C01_007E,S1401_C01_008E,S1401_C01_009E
0,ZCTA5 00775,15,72,81,52,18,0

In [6]:
%%bigquery
select NAME, S1401_C01_004E, S1401_C01_005E, 
S1401_C01_006E, S1401_C01_007E, S1401_C01_008E,
S1401_C01_009E
from acs_2018_modeled.General_School_Enrollment
where NAME = 'ZCTA5 00775'
limit 10

,NAME,S1401_C01_004E,S1401_C01_005E,S1401_C01_006E,S1401_C01_007E,S1401_C01_008E,S1401_C01_009E
0,ZCTA5 00775,15,72,81,52,18,0